# Homework_Seminar3
// 1. Напишите программу, которая принимает на вход пятизначное 
// число и проверяет, является ли оно палиндромом
// 14212->нет 
// 23432->да
// 12821->да

// Console.WriteLine("Введите пятизначное число");
// int num=Convert.ToInt32(Console.ReadLine());
// if(num>9999 && num<10000);
// {
//     int num1=num/10000;
//     int num2=num%10;
//     int num3=num/1000;
//     int num4=num/10;
//     int num5=nuintm5%10;

// if ((num1==num2)&& (num4==num6))
// {
//     Console.WriteLine("Да");
// }
// else if
// {
//     Console.WriteLine("Нет");
// }
// else
// {
//     Console.WriteLine("Введено не пятизначное число");
// }



// 2. Напишите программу, которая принимает на вход координаты двух точек 
// и находит расстояние между ними в 3D пространстве
// A (3,6,8); B (2,1,-7)->15.84
// A (7,-5,0); B (1,-1,9)->11.53

// Console.WriteLine("Введите число X1");
// int X1=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число Y1");
// int Y1=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число C1");
// int C1=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число X2");
// int X2=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число Y2");
// int Y2=Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число C2");
// int C2=Convert.ToInt32(Console.ReadLine());

// double num=Math.Sqrt(Math.Pow((X2-X1),2)+Math.Pow((Y2-Y1),2)+Math.Pow((C2-C1),2));
// Console.WriteLine(num);


// 3. Напишите программу, программу принимает на вход число (N) и выдает таблицу 
// кубов чисел от 1 до N 
// 3->1,8,27
// 5->1,8,27,64,125

// Console.WriteLine("Введите число");
// int num=Convert.ToInt32(Console.ReadLine());

// for(int i=1; i<=num; i++)
// {
//     Console.WriteLine(Math.Pow(i,3));
// }



